# 4강 Merge/ Grouping

In [1]:
import pandas as pd
data=pd.read_csv('kr_googlestore.csv')

<br><br><br>


---------------------

## 1. pd.concat
concat은 연결의 뜻을 가진 concatenation의 줄임말이다. concat은 두 dataframe을 행방향(default할 시) or 열방향으로 단순연결을 해준다. 

concat을 사용할 때는 열의 이름을 주의하면서 살펴봐야한다. 열의 이름이 같아야지만 합쳐주기 때문이다. 만약  열의 이름이 같지 않다면, concat을 하는데 오류가 생긴다. 

``사용법`` **pd.concat**([데이터프레임, 데이터프레임])

- pd.concat() 리스트 형식으로 연결/ pd.merge() 2개의 데이터를 콤마를 이용해서

<br><be><br>

##### 데이터프레임 생성
df3만 마지막 컬럼이 다름

In [22]:
df1 = pd.DataFrame({'이름': ['Park', 'James', 'Rai'],
                    '번호': [82, 1, 91],
                    '순서': ['A', 'B', 'C']})

df2 = pd.DataFrame({'이름': ['Leon', 'Nefert', 'lee'],
                    '번호': [49, 20,82 ],
                    '순서': ['D', 'E', 'F']})

df3 = pd.DataFrame({'이름': ['tae', 'young', 'yeoun'],
                    '번호': [82, 82, 82],
                    '나이': [30, 30, 30]})

### concat 사용

``concat`` ([데이터프레임, 데이터프레임])

같은 열의 이름에 맞춰  세로로 결합된 것을 확인할 수 있다.

In [25]:
pd.concat([df1, df2])

       이름  번호 순서
0    Park  82  A
1   James   1  B
2     Rai  91  C
0    Leon  49  D
1  Nefert  20  E
2     lee  82  F

### 열방향(좌우)로 concat : axis=1

In [30]:
pd.concat([df1,df2],axis=1)

      이름  번호 순서      이름  번호 순서
0   Park  82  A    Leon  49  D
1  James   1  B  Nefert  20  E
2    Rai  91  C     lee  82  F

#### 열이 이름이 다를 때, 생기는 오류.

In [26]:
pd.concat([df1, df3])

C:\Users\park\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     나이  번호   순서     이름
0   NaN  82    A   Park
1   NaN   1    B  James
2   NaN  91    C    Rai
0  30.0  82  NaN    tae
1  30.0  82  NaN  young
2  30.0  82  NaN  yeoun

<br><br>


------

## join